Repository: WordPressBugBounty/plugins-dr-flex
Catalog: dr-flex/languages/dr-flex-*.po
Languages: de_de

source: <span class='green'>Appearance and placement of the booking button</span> for the user (patient) on the practice website (user interface = UI).
de_de: <span class='green'>Erscheinungsbild und Platzierung des Buchungsbuttons</span> für den Nutzer (Patient) auf der Praxiswebsite (user interface = UI).

source: <span class='green'>Behavior of the booking button</span> (User Experience = UX)
de_de: <span class='green'>Verhalten des Buchungsbuttons</span> (User Experience = UX)

source: API key invalid
de_de: API Schlüssel ungültig

source: API key valid
de_de: API Schlüssel gültig

source: Background color as HEX value
de_de: Hintegrundfarbe als HEX Wert

source: Button integration as wordpress menu item
de_de: Button-Einbindung als Wordpress Menüeintrag

source: Button integration with shortcode on pages
de_de: Button-Einbindung mit Shortcodes auf Seiten

source: Callback Code Examples
de_de: Callback Code Beispiele

source: Callback examples
de_de: Callback Beispiele

source: Code examples
de_de: Code Beispiele

source: Configuration
de_de: Konfiguration

source: Configuration data have the wrong format. Error 230
de_de: Konfigurationsdaten haben das falsche Format. Error 230

source: Connection status
de_de: Verbindungsstatus

source: Custom CSS classes for the button
de_de: Custom CSS Klassen für den Button

source: Description
de_de: Beschreibung

source: Does a click open the Dr. Flex booking calendar?
de_de: Öffnet sich beim Klick der Dr. Flex-Buchungskalender?

source: Does the button react or move when the mouse is moved or clicked on it?
de_de: Reagiert, bzw. bewegt sich der Button, wenn mit der Maus darüber gefahren oder geklickt wird?

source: Examples
de_de: Beispiele

source: Font color as HEX value
de_de: Schriftfarbe als HEX Wert

source: Here are some sample code snippets for the callback function which could be used on the configuration page. When using such functions, data protection aspects must be considered, observed and marked accordingly on the page! These examples are provided without any warranty and for informative purposes only.
de_de: Hier finden Sie einige Beispiel-Codeschnipsel für die Callback-Funktion, welche auf der Konfigurationsseite eigesetzt werden könnten. Bei der Verwendung solcher Funktionen müssen Datenschutzaspekte unbedingt beachtet, eingehalten und auf der Seite entsprechend gekennzeichnet werden! Diese Beispiele werden ohne jegliche Gewährleistung und nur zu informativen Zwecken zur Verfügung gestellt.

source: Here is an example short code with all attributes
de_de: Hier ein Beispiel-Shortcode mit allen Attributen

source: Here you can generate a <strong>new API Key for the Wordpress Plugin</strong>.
de_de: Hier können Sie einen <strong>neuen API Key für das Wordpress Plugin generieren</strong>.

source: How does the button stand out from the rest of the website (color, shape, placement)? <span class='green'>(the more striking, the better the service is used)</span>
de_de: Wie hebt sich der Button von der restlichen Website ab (Farbe, Form, Platzierung)? <span class='green'>(je auffälliger, desto besser wird der Service genutzt)</span>

source: If the attributes are not set, the above default values are used. By the way, the attributes can also only be added individually.
de_de: Wenn die Attribute nicht gesetzt werden, werden die oben stehenden Standardwerte verwendet. Die Attribute können übrigens auch nur einzeln ergänzt werden.

source: If you reload the page, you will see the code snippets again.
de_de: Wenn Sie die Seite neu laden, sehen Sie wieder die Code Beispiele.

source: Individual text for the button
de_de: Individueller Text für den Button

source: Is a button placed in the header, footer and under contact / appointment / service (combination with the best conversion) and thus clearly visible to the user on all sub-pages?
de_de: Ist jeweils ein Button im Header, Footer und unter Kontakt / Termin / Service platziert (Kombination mit der besten Conversion) und so für den User auf allen Unterseiten gut sichtbar?

source: Is the button also well integrated in the mobile and tablet version under the above mentioned criteria?
de_de: Ist der Button auch in der mobilen und tablet Version unter den o.g. Kriterien gut integriert?

source: Minimal shortcode
de_de: Minimaler Shortcode

source: Navigate to the <strong>Account tab</strong> and then go to <strong>Settings</strong>.
de_de: Navigieren Sie zum <strong>Reiter Account</strong> und gehen dann auf <strong>Einstellungen</strong>.

source: Not yet connected
de_de: Noch nicht verbunden

source: Note that, the URL has to contain all the characters above, including the parentheses, in order to work properly.
de_de: Hierbei ist zu beachten, dass die URL alle oben abgebildeten Zeichen enthalten muss, inklusive der Klammern, um richtig zu funktionieren.

source: Notes on button integration
de_de: Hinweise zur Button-Integration

source: Now add a text to your link such as "Schedule appointment online" and save the new menu configuration.
de_de: Anschließend muss noch ein Text für den Link hinzugefügt werden, wie beispielsweise "Termin online buchen", und die neue Menü-Konfiguration abgespeichert werden.

source: Optimal button integration
de_de: Optimale Button-Integration

source: Optional JavaScript callback.
de_de: Optionaler JavaScript Callback.

source: Padding as decimal number + CSS unit (px, em, vw, vh, rem, %)
de_de: Padding als Dezimalzahl + CSS-Einheit (px, em, vw, vh, rem, %)

source: Please enter your Dr. Flex API Key
de_de: Bitte geben Sie Ihren Dr. Flex API Key ein

source: Please insert it into the field <strong>API Key</strong>.
de_de: Fügen Sie diesen bitte in das Feld <strong>API Key</strong> ein.

source: Plugin Settings
de_de: Plugin Einstellungen

source: Rounded edges as decimal number + CSS unit (px, em, vw, vh, rem, %)
de_de: Gerundete Kanten als Dezimalzahl + CSS-Einheit (px, em, vw, vh, rem, %)

source: Settings for the booking tool on your website
de_de: Einstellungen für das Buchungstool auf Ihrer Webseite

source: The API key can be found in the settings in the Dr. Flex client application (or <a href="https://dr-flex.de/doctors" target="_blank">here online</a>).
de_de: Den API Key finden Sie in den Einstellungen in der Dr. Flex Praxis Anwendung (oder <a href="https://dr-flex.de/doctors" target="_blank">hier online</a>).

source: The buttons can be integrated via their ID's (e.g. id=1) via <a href="https://codex.wordpress.org/shortcode" target="_blank">Wordpress Shortcodes</a>. Please see also the
de_de: Die Buttons können über Ihre ID\'s (Bsp: id=1) via <a href="https://codex.wordpress.org/shortcode" target="_blank">Wordpress Shortcodes</a> eingebunden werden. Sehen Sie sich dazu bitte auch folgende Infos an:

source: The data for your account could not be loaded.
de_de: Die Daten zu Ihrem Account konnten nicht geladen werden..

source: The following optional attributes can be used in addition to <strong>id</strong> (CSS notation):
de_de: Die folgenden optionalen Attribute können zusätzlich zur <strong>id</strong> verwendet werden (CSS-Notation):

source: The following points should be considered when integrating the booking button on the practice website.
de_de: Folgende Punkte sollten bei der Integration des Buchungs-Buttons auf der Praxiswebsite berücksichtigt werden.

source: The JavaScript code you enter is executed during certain user actions. How this code might look like in different scenarios can be found at
de_de: Der von Ihnen eingegebene JavaScript-Code wird bei bestimmten Benutzeraktionen ausgeführt. Wie dieser Code in verschiedenen Szenarien aussehen könnte finden Sie unter

source: The official Dr. Flex® Wordpress plugin for easy integration of the Dr. Flex® booking tool on your website.
de_de: Das offizielle Dr. Flex® Wordpress-Plugin zur einfachen Integration des Dr. Flex®-Buchungstools auf Ihrer Website.

source: There is no configuration data available at the moment.
de_de: Im Moment liegen keine Konfigurationsdaten vor.

source: To integrate the booking button as a menu item in the site navigation, create a new individual link item in the wordpress menu and add the follwing text as the link URL
de_de: Um den Buchungs-Button als Menüeintrag in der Seitennavigation einzubinden, muss ein individueller Link im Wordpress Menü erstellt werden, welcher den folgenden Text als Link URL enthält

source: Your Buttons
de_de: Ihre Buttons
